12/data/attachments/ac1e1f4b0e3bbb20.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Samantha_southern_Friend_85625_5</nif:username>
            <nif:friendToBeRequested>soap_friends_d576d136-7db5-41f1-bde4-2b4e07f990f4</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>